apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    /* Copy remaining bytes, if any, to last mbuf */
    om->om_len += rem_len;

#if BABBLESIM
    memcpy(dst, src, rem_len);
#else
    __asm__ volatile (".syntax unified              \n"
                      "   b    2f                   \n"
                      "1: ldrb r3, [%[src], %[len]] \n"
                      "   strb r3, [%[dst], %[len]] \n"
                      "2: subs %[len], #1           \n"
                      "   bpl  1b                   \n"
                      : [len] "+r" (rem_len)
                      : [dst] "r" (dst), [src] "r" (src)
                      : "r3", "memory"
                     );
#endif

    /* Copy header */
    memcpy(BLE_MBUF_HDR_PTR(rxpdu), &g_ble_phy_data.rxhdr,
           sizeof(struct ble_mbuf_hdr));
}

/**
 * Called when we want to wait if the radio is in either the rx or tx
 * disable states. We want to wait until that state is over before doing
 * anything to the radio
 */
static void
nrf_wait_disabled(void)
{
    uint32_t state;

    state = NRF_RADIO->STATE;
    if (state != RADIO_STATE_STATE_Disabled) {
        if ((state == RADIO_STATE_STATE_RxDisable) ||
            (state == RADIO_STATE_STATE_TxDisable)) {
            /* This will end within a short time (6 usecs). Just poll */
            while (NRF_RADIO->STATE == state) {
                /* If this fails, something is really wrong. Should last
                 * no more than 6 usecs */
#if BABBLESIM
                tm_tick();
#endif
            }
        }
    }
}

#if MYNEWT_VAL(BLE_PHY_VARIABLE_TIFS)
void
ble_phy_tifs_set(uint16_t tifs)
{
    g_ble_phy_data.tifs = tifs;
}
#endif

/**
 *
 *
 */
static int
ble_phy_set_start_time(uint32_t cputime, uint8_t rem_us, bool tx)
{
    uint32_t next_cc;
    uint32_t cur_cc;
    uint32_t cntr;
    uint32_t delta;
    int radio_rem_us;
#if PHY_USE_FEM
    int fem_rem_us = 0;
#endif
    int rem_us_corr;
    int min_rem_us;

    /* Calculate rem_us for radio and FEM enable. The result may be a negative
     * value, but we'll adjust later.
     */
    if (tx) {
        radio_rem_us = rem_us - BLE_PHY_T_TXENFAST -
                       g_ble_phy_t_txdelay[g_ble_phy_data.phy_cur_phy_mode];
#if PHY_USE_FEM_PA
        fem_rem_us = rem_us - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
#endif
    } else {
        radio_rem_us = rem_us - BLE_PHY_T_TXENFAST;
#if PHY_USE_FEM_LNA
        fem_rem_us = rem_us - MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
#endif
    }

#if PHY_USE_FEM
    min_rem_us = min(radio_rem_us, fem_rem_us);
#else
    min_rem_us = radio_rem_us;
#endif

    /* We need to adjust rem_us values, so they are >=1 for TIMER0 compare
     * event to be triggered.
     *
     * If FEM is not enabled, calculated rem_us is -45<=rem_us<=-15 since we
     * only had to adjust earlier for ramp-up and txdelay, i.e. 40+5=45us in
     * worst case, so we adjust by 1 or 2 tick(s) only.
     *
     * If FEM is enabled, turn on time may be a bit longer, so we also allow to
     * adjust by 3 ticks so up to 90us which should be enough. If needed, we
     * can extend this by another tick but having FEM with turn on time >90us
     * means transition may become tricky.
     */

    if ((PHY_USE_FEM) && (min_rem_us <= -61)) {
        cputime -= 3;
        rem_us_corr = 91;
    } else if (min_rem_us <= -30) {
        /* rem_us is -60..-30 */
        cputime -= 2;
        rem_us_corr = 61;
    } else {
        /* rem_us is -29..0 */
        cputime -= 1;
        rem_us_corr = 30;
    }

    /*
     * Can we set the RTC compare to start TIMER0? We can do it if:
     *      a) Current compare value is not N+1 or N+2 ticks from current
     *      counter.
     *      b) The value we want to set is not at least N+2 from current
     *      counter.
     *
     * NOTE: since the counter can tick 1 while we do these calculations we
     * need to account for it.
     */
    next_cc = cputime & 0xffffff;
    cur_cc = NRF_RTC0->CC[0];
    cntr = NRF_RTC0->COUNTER;

    delta = (cur_cc - cntr) & 0xffffff;
    if ((delta <= 3) && (delta != 0)) {
        return -1;
    }
    delta = (next_cc - cntr) & 0xffffff;
    if ((delta & 0x800000) || (delta < 3)) {
        return -1;
    }

    timer0_reset();

    /* Clear and set TIMER0 to fire off at proper time */
    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CLEAR);
    nrf_timer_cc_set(NRF_TIMER0, 0, radio_rem_us + rem_us_corr);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;
#if PHY_USE_FEM
    if (fem_rem_us) {
        nrf_timer_cc_set(NRF_TIMER0, 2, fem_rem_us + rem_us_corr);
        NRF_TIMER0->EVENTS_COMPARE[2] = 0;
    }
#endif

    /* Set RTC compare to start TIMER0 */
    NRF_RTC0->EVENTS_COMPARE[0] = 0;
    nrf_rtc_cc_set(NRF_RTC0, 0, next_cc);
    nrf_rtc_event_enable(NRF_RTC0, RTC_EVTENSET_COMPARE0_Msk);

    /* Enable PPI */
#if PHY_USE_FEM
    if (fem_rem_us) {
        if (tx) {
#if PHY_USE_FEM_PA
            phy_fem_enable_pa();
#endif
        } else {
#if PHY_USE_FEM_LNA
            phy_fem_enable_lna();
#endif
        }
    }
#endif
    phy_ppi_rtc0_compare0_to_timer0_start_enable();

    /* Store the cputime at which we set the RTC */
    g_ble_phy_data.phy_start_cputime = cputime;

    return 0;
}

static int
ble_phy_set_start_now(void)
{
    os_sr_t sr;
    uint32_t now;
    uint32_t radio_rem_us;
#if PHY_USE_FEM_LNA
    uint32_t fem_rem_us;
#endif

    OS_ENTER_CRITICAL(sr);

    /* We need to set TIMER0 compare registers to at least 1 as otherwise
     * compare event won't be triggered. Event (FEM/radio) that have to be
     * triggered first is set to 1, other event is set to 1+diff.
     *
     * Note that this is only used for rx, so only need to handle LNA.
     */

#if PHY_USE_FEM_LNA
    if (MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US) > BLE_PHY_T_RXENFAST) {
        radio_rem_us = 1 + MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US) -
                       BLE_PHY_T_RXENFAST;
        fem_rem_us = 1;
    } else {
        radio_rem_us = 1;
        fem_rem_us = 1 + BLE_PHY_T_RXENFAST -
                     MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
    }
#else
    radio_rem_us = 1;
#endif

    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CLEAR);
    nrf_timer_cc_set(NRF_TIMER0, 0, radio_rem_us);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;
#if PHY_USE_FEM_LNA
    nrf_timer_cc_set(NRF_TIMER0, 2, fem_rem_us);
    NRF_TIMER0->EVENTS_COMPARE[2] = 0;
#endif

