apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    /* Turn off trigger TXEN on output compare match and AAR on bcmatch */
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();

    /* Reset the rx started flag. Used for the wait for response */
    g_ble_phy_data.phy_rx_started = 0;
    g_ble_phy_data.phy_state = BLE_PHY_STATE_RX;

#if MYNEWT_VAL(BLE_LL_PHY)
    /*
     * On Coded PHY there are CI and TERM1 fields before PDU starts so we need
     * to take this into account when setting up BCC.
     */
    if (g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_125KBPS ||
            g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_500KBPS) {
        g_ble_phy_data.phy_bcc_offset = 5;
    } else {
        g_ble_phy_data.phy_bcc_offset = 0;
    }
#else
    g_ble_phy_data.phy_bcc_offset = 0;
#endif

    /* I want to know when 1st byte received (after address) */
    nrf_radio_bcc_set(NRF_RADIO, 8 + g_ble_phy_data.phy_bcc_offset); /* in bits */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_DEVMATCH = 0;
    NRF_RADIO->EVENTS_BCMATCH = 0;
#ifndef NRF54L_SERIES
    NRF_RADIO->EVENTS_RSSIEND = 0;
#endif
    NRF_RADIO->EVENTS_CRCOK = 0;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
#ifdef NRF54L_SERIES
    NRF_RADIO->SHORTS |= RADIO_SHORTS_PHYEND_DISABLE_Msk;
#else
    NRF_RADIO->SHORTS |= RADIO_SHORTS_END_DISABLE_Msk |
                         RADIO_SHORTS_DISABLED_RSSISTOP_Msk;
#endif
    nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_ADDRESS_Msk |
                                    RADIO_INTENSET_DISABLED_Msk);
}

/**
 * Called from interrupt context when the transmit ends
 *
 */
static void
ble_phy_tx_end_isr(void)
{
    uint8_t tx_phy_mode;
    uint8_t was_encrypted;
    uint8_t transition;
    uint32_t rx_time;
    uint32_t tx_time;
#if PHY_USE_FEM
    uint32_t fem_time;
#endif
    uint32_t radio_time;
    uint16_t tifs;

    /* Store PHY on which we've just transmitted smth */
    tx_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    /* If this transmission was encrypted we need to remember it */
    was_encrypted = g_ble_phy_data.phy_encrypted;
    (void)was_encrypted;

    /* Better be in TX state! */
    assert(g_ble_phy_data.phy_state == BLE_PHY_STATE_TX);

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    /*
     * XXX: not sure what to do. We had a HW error during transmission.
     * For now I just count a stat but continue on like all is good.
     */
    if (was_encrypted) {
        if (NRF_CCM->EVENTS_ERROR) {
            STATS_INC(ble_phy_stats, tx_hw_err);
            NRF_CCM->EVENTS_ERROR = 0;
        }
    }
#endif

#if MYNEWT_VAL(BLE_PHY_VARIABLE_TIFS)
    tifs = g_ble_phy_data.tifs;
    g_ble_phy_data.tifs = BLE_LL_IFS;
#else
    tifs = BLE_LL_IFS;
#endif
    transition = g_ble_phy_data.phy_transition;

    if (g_ble_phy_data.txend_cb) {
        g_ble_phy_data.txend_cb(g_ble_phy_data.txend_arg);
    }

    if (transition == BLE_PHY_TRANSITION_TX_RX) {
#if MYNEWT_VAL(BLE_LL_PHY)
        ble_phy_mode_apply(g_ble_phy_data.phy_rx_phy_mode);
#endif

        /* Packet pointer needs to be reset. */
        ble_phy_rx_xcvr_setup();

        ble_phy_wfr_enable(BLE_PHY_WFR_ENABLE_TXRX, tx_phy_mode, 0);

        /* Schedule RX exactly T_IFS after TX end captured in CC[2] */
        rx_time = NRF_TIMER0->CC[2] + tifs;
        /* Adjust for delay between EVENT_END and actual TX end time */
        rx_time += g_ble_phy_t_txenddelay[tx_phy_mode];
        /* Start listening a bit earlier due to allowed active clock accuracy */
        rx_time -= 2;

#if PHY_USE_FEM_LNA
        fem_time = rx_time - MYNEWT_VAL(BLE_FEM_LNA_TURN_ON_US);
        NRF_TIMER0->EVENTS_COMPARE[2] = 0;
        phy_fem_enable_lna();
        nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
#endif

        radio_time = rx_time - BLE_PHY_T_RXENFAST;
        NRF_TIMER0->EVENTS_COMPARE[0] = 0;
        phy_ppi_timer0_compare0_to_radio_rxen_enable();
        nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);

        /* In case TIMER0 did already count past CC[0] and/or CC[2], radio
         * and/or LNA may not be enabled. In any case we won't be stuck since
         * wfr will cancel rx if needed.
         *
         * FIXME failing to enable LNA may result in unexpected RSSI drop in
         *       case we still rxd something, so perhaps we could check it here
         */
    } else if (transition == BLE_PHY_TRANSITION_TX_TX) {
        if (g_ble_phy_data.txtx_time_anchor) {
            /* Calculate TX anchor relative to current TX end */

            /* TX end timestamp is captured in CC[2] */
            tx_time = NRF_TIMER0->CC[2];
            /* Adjust for delay between EVENT_END and actual TX end time */
            tx_time += g_ble_phy_t_txenddelay[tx_phy_mode];
        } else {
            /* Calculate TX anchor relative to current TX start */

            /* AA timestamp is captured in CC[1] */
            tx_time = NRF_TIMER0->CC[1];
            /* Adjust for delay between EVENT_ADDRESS and actual AA time ota */
            tx_time += g_ble_phy_t_txaddrdelay[tx_phy_mode];
            /* Adjust by sync word length to get TX start time */
            tx_time -= ble_ll_pdu_syncword_us(tx_phy_mode);
        }

        tx_time += g_ble_phy_data.txtx_time_us;

#if PHY_USE_FEM_PA
        fem_time = tx_time - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
#endif

        /* Adjust for delay between EVENT_READY and actual TX start time */
        tx_time -= g_ble_phy_t_txdelay[g_ble_phy_data.phy_cur_phy_mode];

        radio_time = tx_time - BLE_PHY_T_TXENFAST;
        NRF_TIMER0->EVENTS_COMPARE[0] = 0;
        phy_ppi_timer0_compare0_to_radio_txen_enable();
        nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);

#if PHY_USE_FEM_PA
        NRF_TIMER0->EVENTS_COMPARE[2] = 0;
        phy_fem_enable_pa();
        nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
#endif

        if (timer0_did_miss(0, 3)) {
            phy_ppi_timer0_compare0_to_radio_txen_disable();
            g_ble_phy_data.phy_transition_late = 1;
        }
    } else {
        /*
         * XXX: not sure we need to stop the timer here all the time. Or that
         * it should be stopped here.
         */
        nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_STOP);
#ifndef NRF54L_SERIES
        NRF_TIMER0->TASKS_SHUTDOWN = 1;
#endif
        phy_ppi_wfr_disable();
        phy_ppi_timer0_compare0_to_radio_txen_disable();
        phy_ppi_rtc0_compare0_to_timer0_start_disable();
        assert(transition == BLE_PHY_TRANSITION_NONE);
    }
}

